Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_1_4_base_modem/src/packs/PIC32CX2051MTG128_DFP/component/mcspi.h
/*
 * Component description for MCSPI
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:22Z */
#ifndef _PIC32CXMTG_MCSPI_COMPONENT_H_
#define _PIC32CXMTG_MCSPI_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MCSPI                                        */
/* ************************************************************************** */

/* -------- MCSPI_CR : (MCSPI Offset: 0x00) ( /W 32) Control Register -------- */
#define MCSPI_CR_SPIEN_Pos                    _UINT32_(0)                                          /* (MCSPI_CR) MCSPI Enable Position */
#define MCSPI_CR_SPIEN_Msk                    (_UINT32_(0x1) << MCSPI_CR_SPIEN_Pos)                /* (MCSPI_CR) MCSPI Enable Mask */
#define MCSPI_CR_SPIEN(value)                 (MCSPI_CR_SPIEN_Msk & (_UINT32_(value) << MCSPI_CR_SPIEN_Pos)) /* Assigment of value for SPIEN in the MCSPI_CR register */
#define MCSPI_CR_SPIDIS_Pos                   _UINT32_(1)                                          /* (MCSPI_CR) MCSPI Disable Position */
#define MCSPI_CR_SPIDIS_Msk                   (_UINT32_(0x1) << MCSPI_CR_SPIDIS_Pos)               /* (MCSPI_CR) MCSPI Disable Mask */
#define MCSPI_CR_SPIDIS(value)                (MCSPI_CR_SPIDIS_Msk & (_UINT32_(value) << MCSPI_CR_SPIDIS_Pos)) /* Assigment of value for SPIDIS in the MCSPI_CR register */
#define MCSPI_CR_SWRST_Pos                    _UINT32_(7)                                          /* (MCSPI_CR) MCSPI Software Reset Position */
#define MCSPI_CR_SWRST_Msk                    (_UINT32_(0x1) << MCSPI_CR_SWRST_Pos)                /* (MCSPI_CR) MCSPI Software Reset Mask */
#define MCSPI_CR_SWRST(value)                 (MCSPI_CR_SWRST_Msk & (_UINT32_(value) << MCSPI_CR_SWRST_Pos)) /* Assigment of value for SWRST in the MCSPI_CR register */
#define MCSPI_CR_REQCLR_Pos                   _UINT32_(12)                                         /* (MCSPI_CR) Request to Clear the Comparison Trigger Position */
#define MCSPI_CR_REQCLR_Msk                   (_UINT32_(0x1) << MCSPI_CR_REQCLR_Pos)               /* (MCSPI_CR) Request to Clear the Comparison Trigger Mask */
#define MCSPI_CR_REQCLR(value)                (MCSPI_CR_REQCLR_Msk & (_UINT32_(value) << MCSPI_CR_REQCLR_Pos)) /* Assigment of value for REQCLR in the MCSPI_CR register */
#define MCSPI_CR_TXFCLR_Pos                   _UINT32_(16)                                         /* (MCSPI_CR) Transmit FIFO Clear Position */
#define MCSPI_CR_TXFCLR_Msk                   (_UINT32_(0x1) << MCSPI_CR_TXFCLR_Pos)               /* (MCSPI_CR) Transmit FIFO Clear Mask */
#define MCSPI_CR_TXFCLR(value)                (MCSPI_CR_TXFCLR_Msk & (_UINT32_(value) << MCSPI_CR_TXFCLR_Pos)) /* Assigment of value for TXFCLR in the MCSPI_CR register */
#define MCSPI_CR_RXFCLR_Pos                   _UINT32_(17)                                         /* (MCSPI_CR) Receive FIFO Clear Position */
#define MCSPI_CR_RXFCLR_Msk                   (_UINT32_(0x1) << MCSPI_CR_RXFCLR_Pos)               /* (MCSPI_CR) Receive FIFO Clear Mask */
#define MCSPI_CR_RXFCLR(value)                (MCSPI_CR_RXFCLR_Msk & (_UINT32_(value) << MCSPI_CR_RXFCLR_Pos)) /* Assigment of value for RXFCLR in the MCSPI_CR register */
#define MCSPI_CR_LASTXFER_Pos                 _UINT32_(24)                                         /* (MCSPI_CR) Last Transfer Position */
#define MCSPI_CR_LASTXFER_Msk                 (_UINT32_(0x1) << MCSPI_CR_LASTXFER_Pos)             /* (MCSPI_CR) Last Transfer Mask */
#define MCSPI_CR_LASTXFER(value)              (MCSPI_CR_LASTXFER_Msk & (_UINT32_(value) << MCSPI_CR_LASTXFER_Pos)) /* Assigment of value for LASTXFER in the MCSPI_CR register */
#define MCSPI_CR_FIFOEN_Pos                   _UINT32_(30)                                         /* (MCSPI_CR) FIFO Enable Position */
#define MCSPI_CR_FIFOEN_Msk                   (_UINT32_(0x1) << MCSPI_CR_FIFOEN_Pos)               /* (MCSPI_CR) FIFO Enable Mask */
#define MCSPI_CR_FIFOEN(value)                (MCSPI_CR_FIFOEN_Msk & (_UINT32_(value) << MCSPI_CR_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the MCSPI_CR register */
#define MCSPI_CR_FIFODIS_Pos                  _UINT32_(31)                                         /* (MCSPI_CR) FIFO Disable Position */
#define MCSPI_CR_FIFODIS_Msk                  (_UINT32_(0x1) << MCSPI_CR_FIFODIS_Pos)              /* (MCSPI_CR) FIFO Disable Mask */
#define MCSPI_CR_FIFODIS(value)               (MCSPI_CR_FIFODIS_Msk & (_UINT32_(value) << MCSPI_CR_FIFODIS_Pos)) /* Assigment of value for FIFODIS in the MCSPI_CR register */
#define MCSPI_CR_Msk                          _UINT32_(0xC1031083)                                 /* (MCSPI_CR) Register Mask  */


/* -------- MCSPI_MR : (MCSPI Offset: 0x04) (R/W 32) Mode Register -------- */
#define MCSPI_MR_MSTR_Pos                     _UINT32_(0)                                          /* (MCSPI_MR) Host/Client Mode Position */
#define MCSPI_MR_MSTR_Msk                     (_UINT32_(0x1) << MCSPI_MR_MSTR_Pos)                 /* (MCSPI_MR) Host/Client Mode Mask */
#define MCSPI_MR_MSTR(value)                  (MCSPI_MR_MSTR_Msk & (_UINT32_(value) << MCSPI_MR_MSTR_Pos)) /* Assigment of value for MSTR in the MCSPI_MR register */
#define MCSPI_MR_PS_Pos                       _UINT32_(1)                                          /* (MCSPI_MR) Peripheral Select Position */
#define MCSPI_MR_PS_Msk                       (_UINT32_(0x1) << MCSPI_MR_PS_Pos)                   /* (MCSPI_MR) Peripheral Select Mask */
#define MCSPI_MR_PS(value)                    (MCSPI_MR_PS_Msk & (_UINT32_(value) << MCSPI_MR_PS_Pos)) /* Assigment of value for PS in the MCSPI_MR register */
#define MCSPI_MR_PCSDEC_Pos                   _UINT32_(2)                                          /* (MCSPI_MR) Chip Select Decode Position */
#define MCSPI_MR_PCSDEC_Msk                   (_UINT32_(0x1) << MCSPI_MR_PCSDEC_Pos)               /* (MCSPI_MR) Chip Select Decode Mask */
#define MCSPI_MR_PCSDEC(value)                (MCSPI_MR_PCSDEC_Msk & (_UINT32_(value) << MCSPI_MR_PCSDEC_Pos)) /* Assigment of value for PCSDEC in the MCSPI_MR register */
#define MCSPI_MR_BRSRCCLK_Pos                 _UINT32_(3)                                          /* (MCSPI_MR) Bit Rate Source Clock Position */
#define MCSPI_MR_BRSRCCLK_Msk                 (_UINT32_(0x1) << MCSPI_MR_BRSRCCLK_Pos)             /* (MCSPI_MR) Bit Rate Source Clock Mask */
#define MCSPI_MR_BRSRCCLK(value)              (MCSPI_MR_BRSRCCLK_Msk & (_UINT32_(value) << MCSPI_MR_BRSRCCLK_Pos)) /* Assigment of value for BRSRCCLK in the MCSPI_MR register */
#define   MCSPI_MR_BRSRCCLK_PERIPH_CLK_Val    _UINT32_(0x0)                                        /* (MCSPI_MR) The peripheral clock is the source clock for the bit rate generation.  */
#define   MCSPI_MR_BRSRCCLK_GCLK_Val          _UINT32_(0x1)                                        /* (MCSPI_MR) PMC GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock.  */
#define MCSPI_MR_BRSRCCLK_PERIPH_CLK          (MCSPI_MR_BRSRCCLK_PERIPH_CLK_Val << MCSPI_MR_BRSRCCLK_Pos) /* (MCSPI_MR) The peripheral clock is the source clock for the bit rate generation. Position  */
#define MCSPI_MR_BRSRCCLK_GCLK                (MCSPI_MR_BRSRCCLK_GCLK_Val << MCSPI_MR_BRSRCCLK_Pos) /* (MCSPI_MR) PMC GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock. Position  */
#define MCSPI_MR_MODFDIS_Pos                  _UINT32_(4)                                          /* (MCSPI_MR) Mode Fault Detection Position */
#define MCSPI_MR_MODFDIS_Msk                  (_UINT32_(0x1) << MCSPI_MR_MODFDIS_Pos)              /* (MCSPI_MR) Mode Fault Detection Mask */
#define MCSPI_MR_MODFDIS(value)               (MCSPI_MR_MODFDIS_Msk & (_UINT32_(value) << MCSPI_MR_MODFDIS_Pos)) /* Assigment of value for MODFDIS in the MCSPI_MR register */
#define MCSPI_MR_WDRBT_Pos                    _UINT32_(5)                                          /* (MCSPI_MR) Wait for Data Read Before Transfer Position */
#define MCSPI_MR_WDRBT_Msk                    (_UINT32_(0x1) << MCSPI_MR_WDRBT_Pos)                /* (MCSPI_MR) Wait for Data Read Before Transfer Mask */
#define MCSPI_MR_WDRBT(value)                 (MCSPI_MR_WDRBT_Msk & (_UINT32_(value) << MCSPI_MR_WDRBT_Pos)) /* Assigment of value for WDRBT in the MCSPI_MR register */
#define MCSPI_MR_CRCEN_Pos                    _UINT32_(6)                                          /* (MCSPI_MR) CRC Enable Position */
#define MCSPI_MR_CRCEN_Msk                    (_UINT32_(0x1) << MCSPI_MR_CRCEN_Pos)                /* (MCSPI_MR) CRC Enable Mask */
#define MCSPI_MR_CRCEN(value)                 (MCSPI_MR_CRCEN_Msk & (_UINT32_(value) << MCSPI_MR_CRCEN_Pos)) /* Assigment of value for CRCEN in the MCSPI_MR register */
#define MCSPI_MR_LLB_Pos                      _UINT32_(7)                                          /* (MCSPI_MR) Local Loopback Enable Position */
#define MCSPI_MR_LLB_Msk                      (_UINT32_(0x1) << MCSPI_MR_LLB_Pos)                  /* (MCSPI_MR) Local Loopback Enable Mask */
#define MCSPI_MR_LLB(value)                   (MCSPI_MR_LLB_Msk & (_UINT32_(value) << MCSPI_MR_LLB_Pos)) /* Assigment of value for LLB in the MCSPI_MR register */
#define MCSPI_MR_LSBHALF_Pos                  _UINT32_(8)                                          /* (MCSPI_MR) LSB Timing Selection Position */
#define MCSPI_MR_LSBHALF_Msk                  (_UINT32_(0x1) << MCSPI_MR_LSBHALF_Pos)              /* (MCSPI_MR) LSB Timing Selection Mask */
#define MCSPI_MR_LSBHALF(value)               (MCSPI_MR_LSBHALF_Msk & (_UINT32_(value) << MCSPI_MR_LSBHALF_Pos)) /* Assigment of value for LSBHALF in the MCSPI_MR register */
#define MCSPI_MR_TMCSMUX_Pos                  _UINT32_(9)                                          /* (MCSPI_MR) Two-pin MOSI Chip Select External Multiplexing Mode Position */
#define MCSPI_MR_TMCSMUX_Msk                  (_UINT32_(0x1) << MCSPI_MR_TMCSMUX_Pos)              /* (MCSPI_MR) Two-pin MOSI Chip Select External Multiplexing Mode Mask */
#define MCSPI_MR_TMCSMUX(value)               (MCSPI_MR_TMCSMUX_Msk & (_UINT32_(value) << MCSPI_MR_TMCSMUX_Pos)) /* Assigment of value for TMCSMUX in the MCSPI_MR register */
#define   MCSPI_MR_TMCSMUX_DISABLED_Val       _UINT32_(0x0)                                        /* (MCSPI_MR) External MOSI lines multiplexing is not required via Chip Select lines. When MCSPI_MR.TPMEN=0, MCSPI_TWMR.MIL=1 or MCSPI_TWMR.CSM=0, TMCSMUX must be written to 0.  */
#define   MCSPI_MR_TMCSMUX_ENABLED_Val        _UINT32_(0x1)                                        /* (MCSPI_MR) Enables external multiplexing of MOSI lines via Chip Select lines. When MCSPI_MR.TPMEN=1, TMCSMUX must be written to 1 if MCSPI_TWMR.MIL=0 and MCSPI_TWMR.CSM=1.  */
#define MCSPI_MR_TMCSMUX_DISABLED             (MCSPI_MR_TMCSMUX_DISABLED_Val << MCSPI_MR_TMCSMUX_Pos) /* (MCSPI_MR) External MOSI lines multiplexing is not required via Chip Select lines. When MCSPI_MR.TPMEN=0, MCSPI_TWMR.MIL=1 or MCSPI_TWMR.CSM=0, TMCSMUX must be written to 0. Position  */
#define MCSPI_MR_TMCSMUX_ENABLED              (MCSPI_MR_TMCSMUX_ENABLED_Val << MCSPI_MR_TMCSMUX_Pos) /* (MCSPI_MR) Enables external multiplexing of MOSI lines via Chip Select lines. When MCSPI_MR.TPMEN=1, TMCSMUX must be written to 1 if MCSPI_TWMR.MIL=0 and MCSPI_TWMR.CSM=1. Position  */
#define MCSPI_MR_CMPMODE_Pos                  _UINT32_(12)                                         /* (MCSPI_MR) Comparison Mode Position */
#define MCSPI_MR_CMPMODE_Msk                  (_UINT32_(0x1) << MCSPI_MR_CMPMODE_Pos)              /* (MCSPI_MR) Comparison Mode Mask */
#define MCSPI_MR_CMPMODE(value)               (MCSPI_MR_CMPMODE_Msk & (_UINT32_(value) << MCSPI_MR_CMPMODE_Pos)) /* Assigment of value for CMPMODE in the MCSPI_MR register */
#define   MCSPI_MR_CMPMODE_FLAG_ONLY_Val      _UINT32_(0x0)                                        /* (MCSPI_MR) Any character is received and comparison function drives CMP flag.  */
#define   MCSPI_MR_CMPMODE_START_CONDITION_Val _UINT32_(0x1)                                        /* (MCSPI_MR) Comparison condition must be met to start reception of all incoming characters until REQCLR is set.  */
#define MCSPI_MR_CMPMODE_FLAG_ONLY            (MCSPI_MR_CMPMODE_FLAG_ONLY_Val << MCSPI_MR_CMPMODE_Pos) /* (MCSPI_MR) Any character is received and comparison function drives CMP flag. Position  */
#define MCSPI_MR_CMPMODE_START_CONDITION      (MCSPI_MR_CMPMODE_START_CONDITION_Val << MCSPI_MR_CMPMODE_Pos) /* (MCSPI_MR) Comparison condition must be met to start reception of all incoming characters until REQCLR is set. Position  */
#define MCSPI_MR_TPMEN_Pos                    _UINT32_(13)                                         /* (MCSPI_MR) Two-Pin Mode Enable Position */
#define MCSPI_MR_TPMEN_Msk                    (_UINT32_(0x1) << MCSPI_MR_TPMEN_Pos)                /* (MCSPI_MR) Two-Pin Mode Enable Mask */
#define MCSPI_MR_TPMEN(value)                 (MCSPI_MR_TPMEN_Msk & (_UINT32_(value) << MCSPI_MR_TPMEN_Pos)) /* Assigment of value for TPMEN in the MCSPI_MR register */
#define MCSPI_MR_CSIE_Pos                     _UINT32_(14)                                         /* (MCSPI_MR) Chip Select Inversion Enable Position */
#define MCSPI_MR_CSIE_Msk                     (_UINT32_(0x1) << MCSPI_MR_CSIE_Pos)                 /* (MCSPI_MR) Chip Select Inversion Enable Mask */
#define MCSPI_MR_CSIE(value)                  (MCSPI_MR_CSIE_Msk & (_UINT32_(value) << MCSPI_MR_CSIE_Pos)) /* Assigment of value for CSIE in the MCSPI_MR register */
#define MCSPI_MR_MOSIIE_Pos                   _UINT32_(15)                                         /* (MCSPI_MR) MOSI Inversion Enable Position */
#define MCSPI_MR_MOSIIE_Msk                   (_UINT32_(0x1) << MCSPI_MR_MOSIIE_Pos)               /* (MCSPI_MR) MOSI Inversion Enable Mask */
#define MCSPI_MR_MOSIIE(value)                (MCSPI_MR_MOSIIE_Msk & (_UINT32_(value) << MCSPI_MR_MOSIIE_Pos)) /* Assigment of value for MOSIIE in the MCSPI_MR register */
#define MCSPI_MR_PCS_Pos                      _UINT32_(16)                                         /* (MCSPI_MR) Peripheral Chip Select Position */
#define MCSPI_MR_PCS_Msk                      (_UINT32_(0xF) << MCSPI_MR_PCS_Pos)                  /* (MCSPI_MR) Peripheral Chip Select Mask */
#define MCSPI_MR_PCS(value)                   (MCSPI_MR_PCS_Msk & (_UINT32_(value) << MCSPI_MR_PCS_Pos)) /* Assigment of value for PCS in the MCSPI_MR register */
#define MCSPI_MR_DLYBCS_Pos                   _UINT32_(24)                                         /* (MCSPI_MR) Delay Between Chip Selects Position */
#define MCSPI_MR_DLYBCS_Msk                   (_UINT32_(0xFF) << MCSPI_MR_DLYBCS_Pos)              /* (MCSPI_MR) Delay Between Chip Selects Mask */
#define MCSPI_MR_DLYBCS(value)                (MCSPI_MR_DLYBCS_Msk & (_UINT32_(value) << MCSPI_MR_DLYBCS_Pos)) /* Assigment of value for DLYBCS in the MCSPI_MR register */
#define MCSPI_MR_Msk                          _UINT32_(0xFF0FF3FF)                                 /* (MCSPI_MR) Register Mask  */


